// 1. Сначала импортируем картинку как переменную
import logoImg from "./assets/logo.png";

// 2. Подставляем эту переменную в массив
export const servicesData = [
  {
    id: 1,
    title: "Цифровая печать",
    description: "Быстрая и качественная печать визиток, листовок и буклетов.",
    image: logoImg, // <-- Передаем переменную, а не строку!
  },
  {
    id: 2,
    title: "Широкоформатная печать",
    description:
      "Баннеры, плакаты и вывески любого размера для вашего бизнеса.",
    image: logoImg,
  },
  {
    id: 3,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 4,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 5,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 6,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 7,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 8,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 9,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 10,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 11,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 12,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 13,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 14,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 15,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 16,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 17,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 18,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },

  {
    id: 19,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
  {
    id: 20,
    title: "Сувенирная продукция",
    description: "Печать на кружках, футболках, кепках и ручках.",
    image: logoImg,
  },
];
